---
title: ExportPatternTableIterator
classe: Autodesk.Revit.DB.ExportPatternTableIterator
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 6
---

# ExportPatternTableIterator

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `KeyValuePair<ExportPatternKey, ExportPatternInfo> Current { get; }` | `exportPatternTableIterator.Current` | KeyValuePair<ExportPatternKey, ExportPatternInfo> |
| `Boolean IsValidObject { get; }` | `exportPatternTableIterator.IsValidObject` | Boolean |
| `Void Dispose()` | `exportPatternTableIterator.Dispose()` | Void |
| `Boolean IsDone()` | `exportPatternTableIterator.IsDone()` | Boolean |
| `Boolean MoveNext()` | `exportPatternTableIterator.MoveNext()` | Boolean |
| `Void Reset()` | `exportPatternTableIterator.Reset()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```